In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [6]:
df = pd.read_csv('Datasets/datafile (3).csv')

In [8]:
df.head()

,Crop,Variety,Season/ duration in days,Recommended Zone
0,Paddy,Chinsurah Rice (IET 19140),150,"Andhra Pradesh, Tamil Nadu, Gujarat, Orissa, W..."
1,Paddy,(CNI 383-5-11),144,NaN
2,Paddy,IGKVR-1 (IET 19569),110,"Chhattisgarh, Madhya Pradesh, Orissa"
3,Paddy,IGKVR-2 (IET 19795),150,"Chhattisgarh, Bihar, Orissa"
4,Paddy,CR Dhan 401 (REETA),148,"Orissa, West Bengal, Tamil Nadu, Andhra Pradesh"

In [10]:
len(df['Variety'].unique())

78

In [12]:
df.isnull().sum()

Crop                        0
Variety                     0
Season/ duration in days    0
Recommended Zone            1
dtype: int64

In [14]:
fdf=pd.DataFrame()

In [16]:
#adding Crops
fdf['Crop']=df['Crop']
#adding Variety
fdf['Variety']=df['Variety']
#adding the State list
fdf['State'] = df['Recommended Zone'].str.split(',')
fdf['State'][0][0]
#Season/ duration in days
fdf['Duration in days'] = df['Season/ duration in days']

In [18]:
fdf['State']=fdf['State'].fillna(fdf['State'].mode())

In [20]:
fdf.head()
#fdf.to_csv('recomended_df.csv', index=False)

,Crop,Variety,State,Duration in days
0,Paddy,Chinsurah Rice (IET 19140),"[Andhra Pradesh, Tamil Nadu, Gujarat, Oriss...",150
1,Paddy,(CNI 383-5-11),"[Himachal Pradesh, Uttarakhand, Jammu And Ka...",144
2,Paddy,IGKVR-1 (IET 19569),"[Chhattisgarh, Madhya Pradesh, Orissa]",110
3,Paddy,IGKVR-2 (IET 19795),"[Chhattisgarh, Bihar, Orissa]",150
4,Paddy,CR Dhan 401 (REETA),"[Orissa, West Bengal, Tamil Nadu, Andhra Pr...",148

In [23]:
for i in fdf['State'][1]:
    print (i,end=', ') 
fdf=fdf.explode('State')

Himachal Pradesh,  Uttarakhand,  Jammu And Kashmir,  Arunachal Pradesh,  Assam,  Manipur,  Meghalaya,  Mizoram,  Nagaland,  Sikkim,  Tripura,

In [25]:
fdf.head()

    Crop                     Variety           State  Duration in days
0  Paddy  Chinsurah Rice (IET 19140)  Andhra Pradesh               150
0  Paddy  Chinsurah Rice (IET 19140)      Tamil Nadu               150
0  Paddy  Chinsurah Rice (IET 19140)         Gujarat               150
0  Paddy  Chinsurah Rice (IET 19140)          Orissa               150
0  Paddy  Chinsurah Rice (IET 19140)     West Bengal               150

In [27]:
# List of crops to keep
valid_crops = [
    "Paddy", "Wheat", "Maize", "Barley", "Pearl Millet",
    "Finger Millet", "Bengal Gram", "Indian Mustard",
    "Groundnut", "Sugarcane", "Cotton", "Jute", "Mesta"
]

# Filter rows where the crop is in the valid_crops list
filtered_df = fdf[fdf['Crop'].isin(valid_crops)]

In [29]:
filtered_df.head()

    Crop                     Variety           State  Duration in days
0  Paddy  Chinsurah Rice (IET 19140)  Andhra Pradesh               150
0  Paddy  Chinsurah Rice (IET 19140)      Tamil Nadu               150
0  Paddy  Chinsurah Rice (IET 19140)         Gujarat               150
0  Paddy  Chinsurah Rice (IET 19140)          Orissa               150
0  Paddy  Chinsurah Rice (IET 19140)     West Bengal               150

In [31]:
filtered_df.shape

(277, 4)

In [33]:
filtered_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 277 entries, 0 to 77
Data columns (total 4 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Crop              277 non-null    object
 1   Variety           277 non-null    object
 2   State             277 non-null    object
 3   Duration in days  277 non-null    int64
dtypes: int64(1), object(3)
memory usage: 10.8+ KB

In [36]:
#inserting the column
df1=pd.read_csv("Datasets/datafile (1).csv")
df1['Crop'].unique()
df1.columns

Index(['Crop', 'State', 'Cost of Cultivation (`/Hectare) A2+FL',
       'Cost of Cultivation (`/Hectare) C2',
       'Cost of Production (`/Quintal) C2', 'Yield (Quintal/ Hectare) '],
      dtype='object')

In [39]:
filtered_df.head()

    Crop                     Variety           State  Duration in days
0  Paddy  Chinsurah Rice (IET 19140)  Andhra Pradesh               150
0  Paddy  Chinsurah Rice (IET 19140)      Tamil Nadu               150
0  Paddy  Chinsurah Rice (IET 19140)         Gujarat               150
0  Paddy  Chinsurah Rice (IET 19140)          Orissa               150
0  Paddy  Chinsurah Rice (IET 19140)     West Bengal               150

In [42]:
#df1_exploded = filtered_df.explode('State')

In [44]:
merged_df = pd.merge(filtered_df, df1[['Crop', 'State', 'Cost of Cultivation (`/Hectare) C2']], on=['Crop', 'State'], how='left') 

# Rename the 'Cost of Cultivation (₹/Hectare) C2' column to 'cost'

In [46]:
# Rename the 'Cost of Cultivation (₹/Hectare) C2' column to 'cost' 
merged_df.rename(columns={'Cost of Cultivation (`/Hectare) C2': 'Cost'}, inplace=True)

In [48]:
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 277 entries, 0 to 276
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Crop              277 non-null    object
 1   Variety           277 non-null    object
 2   State             277 non-null    object
 3   Duration in days  277 non-null    int64
 4   Cost              24 non-null     float64
dtypes: float64(1), int64(1), object(3)
memory usage: 10.9+ KB

In [50]:
merged_df['Cost'] = pd.to_numeric(merged_df['Cost'], errors='coerce')
if merged_df['Cost'].isna().any():
    print("There are NaN or invalid values in the 'Cost' column.")

There are NaN or invalid values in the 'Cost' column.

In [52]:
invalid_rows = merged_df[merged_df['Cost'].isna()]
print(invalid_rows)

       Crop                     Variety             State  Duration in days  \
1     Paddy  Chinsurah Rice (IET 19140)        Tamil Nadu               150
2     Paddy  Chinsurah Rice (IET 19140)           Gujarat               150
3     Paddy  Chinsurah Rice (IET 19140)            Orissa               150
4     Paddy  Chinsurah Rice (IET 19140)       West Bengal               150
5     Paddy              (CNI 383-5-11)  Himachal Pradesh               144
..      ...                         ...               ...               ...
271  Cotton                   VBCH 2231           Gujarat               157
272  Cotton                   VBCH 2231    Madhya Pradesh               157
273  Cotton                   VBCH 2231            Orissa               157
275  Cotton                     FDK 124           Haryana               158
276  Cotton                     FDK 124         Rajasthan               158

     Cost
1     NaN
2     NaN
3     NaN
4     NaN
5     NaN
..    ...
271   NaN
272   NaN
273   NaN
275   NaN
276   NaN

[253 rows x 5 columns]

In [54]:
# Calculate the mean cost for each crop 
mean_costs = merged_df.groupby('Crop')['Cost'].transform('mean') 
# Fill NaN values with the mean cost for the same crop 
merged_df['Cost'] = merged_df['Cost'].fillna(mean_costs)

In [56]:
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 277 entries, 0 to 276
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Crop              277 non-null    object
 1   Variety           277 non-null    object
 2   State             277 non-null    object
 3   Duration in days  277 non-null    int64
 4   Cost              198 non-null    float64
dtypes: float64(1), int64(1), object(3)
memory usage: 10.9+ KB

In [58]:
merged_df['Cost'].unique()

array([46450.2  , 31603.2  , 25909.05 , 28144.5  , 22489.75 , 31428.438,
       35423.48 , 31902.74 ,       nan, 26094.56 , 20671.54 , 37801.85 ,
       19810.29 , 19259.84 , 21735.185, 22560.3  , 17314.2  , 16873.17 ,
       17776.25 , 18679.33 , 89025.27 , 42070.44 , 44211.23 , 50828.83 ,
       33116.82 ])

In [61]:
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 277 entries, 0 to 276
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Crop              277 non-null    object
 1   Variety           277 non-null    object
 2   State             277 non-null    object
 3   Duration in days  277 non-null    int64
 4   Cost              198 non-null    float64
dtypes: float64(1), int64(1), object(3)
memory usage: 10.9+ KB

In [63]:
invalid_rows = merged_df[merged_df['Cost'].isna()]
print(invalid_rows)

       Crop           Variety            State  Duration in days  Cost
93   Barley            BH-902           Punjab               130   NaN
94   Barley            BH-902          Haryana               130   NaN
95   Barley            BH-902    Uttar Pradesh               130   NaN
96   Barley            BH-902            Delhi               130   NaN
97   Barley            BH-902        Rajasthan               130   NaN
..      ...               ...              ...               ...   ...
259   Mesta  SHRESTHA (JRM-5)           Orissa               134   NaN
260   Mesta  SHRESTHA (JRM-5)            Assam               134   NaN
261   Mesta  SHRESTHA (JRM-5)      Maharashtra               134   NaN
262   Mesta  SHRESTHA (JRM-5)            Bihar               134   NaN
263   Mesta  SHRESTHA (JRM-5)      West Bengal               134   NaN

[79 rows x 5 columns]

In [65]:
overall_mean = merged_df['Cost'].mean()
merged_df['Cost'] = merged_df['Cost'].fillna(overall_mean)
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 277 entries, 0 to 276
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Crop              277 non-null    object
 1   Variety           277 non-null    object
 2   State             277 non-null    object
 3   Duration in days  277 non-null    int64
 4   Cost              277 non-null    float64
dtypes: float64(1), int64(1), object(3)
memory usage: 10.9+ KB

## Quantity Column

In [68]:
df2 = pd.read_csv("Datasets/datafile (2).csv")

In [70]:
df2.head()

,Crop,Production 2006-07,Production 2007-08,Production 2008-09,Production 2009-10,Production 2010-11,Area 2006-07,Area 2007-08,Area 2008-09,Area 2009-10,Area 2010-11,Yield 2006-07,Yield 2007-08,Yield 2008-09,Yield 2009-10,Yield 2010-11
0,Total Foodgrains,158.8,168.6,171.3,159.4,178.9,128.5,128.8,127.6,126.0,131.7,123.6,130.9,134.3,126.5,135.9
1,Paddy,200.8,207.9,213.3,191.6,206.4,168.5,168.9,175.1,161.2,164.8,119.2,123.1,121.8,118.9,125.2
2,Wheat,131.6,136.4,140.1,140.3,150.8,115.0,115.2,114.0,116.9,119.5,114.4,118.4,122.8,120.0,126.3
3,Jowar,124.3,137.8,126.0,116.5,121.8,120.7,110.6,107.3,111.0,105.2,103.0,124.6,117.4,105.0,115.8
4,Pearl Millet,136.4,161.5,143.9,105.4,167.9,94.5,95.1,87.0,88.5,95.6,144.3,169.7,165.4,119.0,175.8

In [72]:
df2["Avg_Area"] = df2[["Area 2006-07", "Area 2007-08", "Area 2008-09", "Area 2009-10", "Area 2010-11"]].mean(axis=1)

In [74]:
df2.head()

,Crop,Production 2006-07,Production 2007-08,Production 2008-09,Production 2009-10,Production 2010-11,Area 2006-07,Area 2007-08,Area 2008-09,Area 2009-10,Area 2010-11,Yield 2006-07,Yield 2007-08,Yield 2008-09,Yield 2009-10,Yield 2010-11,Avg_Area
0,Total Foodgrains,158.8,168.6,171.3,159.4,178.9,128.5,128.8,127.6,126.0,131.7,123.6,130.9,134.3,126.5,135.9,128.52
1,Paddy,200.8,207.9,213.3,191.6,206.4,168.5,168.9,175.1,161.2,164.8,119.2,123.1,121.8,118.9,125.2,167.70
2,Wheat,131.6,136.4,140.1,140.3,150.8,115.0,115.2,114.0,116.9,119.5,114.4,118.4,122.8,120.0,126.3,116.12
3,Jowar,124.3,137.8,126.0,116.5,121.8,120.7,110.6,107.3,111.0,105.2,103.0,124.6,117.4,105.0,115.8,110.96
4,Pearl Millet,136.4,161.5,143.9,105.4,167.9,94.5,95.1,87.0,88.5,95.6,144.3,169.7,165.4,119.0,175.8,92.14

In [76]:
df2['Crop'].unique()

array(['Total Foodgrains', 'Paddy', 'Wheat', 'Jowar', 'Pearl Millet',
       'Maize', 'Finger Millet', 'Small Millets', 'Barley',
       'Coarse Cereals', 'Cereals', 'Bengal Gram', 'Arhar',
       'Other Pulses', 'Total Pulses', 'Total Non-Food Grains',
       'Total Oilseeds', 'Groundnut', 'Sesame', 'Indian Mustard',
       'Linseed', 'Castor Seed', 'Safflower', 'Niger Seed', 'Sunflower',
       'Soyabean', 'Nine Oilseeds', 'Coconut', 'Cotton Seed',
       'Total Fibers', 'Cotton', 'Jute', 'Mesta', 'Jute & Mesta',
       'Sannhamp', 'Tea', 'Coffee', 'Rubber', 'Total Spices',
       'Black Pepper', 'Dry Chilies', 'Dry Ginger', 'Turmeric',
       'Arecanut', 'Cardamom', 'Coriander', 'Garlic',
       'Total Fruits & Vegetables', 'Potato', 'Tapioca', 'Sweet Potato',
       'Onion', 'Banana', 'Sugarcane', 'Tobacco'], dtype=object)

In [78]:
# Making the 'Quantity' Column
merged_df = pd.merge(merged_df, df2[['Crop', 'Avg_Area']], on='Crop', how='left') 
merged_df.rename(columns={'Avg_Area': 'Quantity'}, inplace=True)

In [80]:
merged_df.head()

,Crop,Variety,State,Duration in days,Cost,Quantity
0,Paddy,Chinsurah Rice (IET 19140),Andhra Pradesh,150,46450.2,167.7
1,Paddy,Chinsurah Rice (IET 19140),Tamil Nadu,150,31603.2,167.7
2,Paddy,Chinsurah Rice (IET 19140),Gujarat,150,31603.2,167.7
3,Paddy,Chinsurah Rice (IET 19140),Orissa,150,31603.2,167.7
4,Paddy,Chinsurah Rice (IET 19140),West Bengal,150,31603.2,167.7

In [82]:
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 277 entries, 0 to 276
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Crop              277 non-null    object
 1   Variety           277 non-null    object
 2   State             277 non-null    object
 3   Duration in days  277 non-null    int64
 4   Cost              277 non-null    float64
 5   Quantity          277 non-null    float64
dtypes: float64(2), int64(1), object(3)
memory usage: 13.1+ KB

In [84]:
#

## Production/Duration

In [88]:
df2["Total_Production"] = df2[["Production 2006-07", "Production 2007-08", "Production 2008-09", "Production 2009-10", "Production 2010-11"]].sum(axis=1)

In [90]:
df2["Predicted_Production"] = df2["Total_Production"] * (merged_df["Duration in days"] / 365)
# Making the 'Quantity' Column
merged_df = pd.merge(merged_df, df2[['Crop', "Predicted_Production"]], on='Crop', how='left') 
#merged_df.rename(columns={"Predicted_Production": 'Quantity'}, inplace=True)

In [92]:
merged_df.head()

,Crop,Variety,State,Duration in days,Cost,Quantity,Predicted_Production
0,Paddy,Chinsurah Rice (IET 19140),Andhra Pradesh,150,46450.2,167.7,419.178082
1,Paddy,Chinsurah Rice (IET 19140),Tamil Nadu,150,31603.2,167.7,419.178082
2,Paddy,Chinsurah Rice (IET 19140),Gujarat,150,31603.2,167.7,419.178082
3,Paddy,Chinsurah Rice (IET 19140),Orissa,150,31603.2,167.7,419.178082
4,Paddy,Chinsurah Rice (IET 19140),West Bengal,150,31603.2,167.7,419.178082

In [94]:
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 277 entries, 0 to 276
Data columns (total 7 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Crop                  277 non-null    object
 1   Variety               277 non-null    object
 2   State                 277 non-null    object
 3   Duration in days      277 non-null    int64
 4   Cost                  277 non-null    float64
 5   Quantity              277 non-null    float64
 6   Predicted_Production  277 non-null    float64
dtypes: float64(3), int64(1), object(3)
memory usage: 15.3+ KB

In [96]:
Production_mean = merged_df['Predicted_Production'].mean()
merged_df['Predicted_Production'] = merged_df['Predicted_Production'].fillna(Production_mean)
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 277 entries, 0 to 276
Data columns (total 7 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Crop                  277 non-null    object
 1   Variety               277 non-null    object
 2   State                 277 non-null    object
 3   Duration in days      277 non-null    int64
 4   Cost                  277 non-null    float64
 5   Quantity              277 non-null    float64
 6   Predicted_Production  277 non-null    float64
dtypes: float64(3), int64(1), object(3)
memory usage: 15.3+ KB

In [98]:
merged_df.to_csv('Final_df.csv', index=False)